# Week 03 - SQL

* https://www.analyticsvidhya.com/blog/2022/06/an-introduction-to-joins-in-mysql/
* https://towardsdatascience.com/how-to-run-sql-queries-from-a-jupyter-notebook-aaa18e59e7bc
* https://www.digitalocean.com/community/tutorials/how-to-use-the-sqlite3-module-in-python-3

In [1]:
# !pip install ipython-sql

In [2]:
# load sql and use sqlite as out database
%load_ext sql
%sql sqlite://

In [3]:
%%sql 
CREATE TABLE aTable
(
    pkey     INTEGER PRIMARY KEY,
    name     varchar(24)
);
INSERT INTO aTable (name)
VALUES ('Bugs Bunny'),
       ('Popeye'),
       ('Daffy Duck'),
       ('Mickey Mouse'),
       ('Minnie Mouse'),
       ('Tweety');
    
CREATE TABLE bTable
(
    pkey     INTEGER PRIMARY KEY,
    fkey     int,
    name     varchar(24)
);
INSERT INTO bTable(fkey, name)
VALUES (1, 'Bugs Bunny'),
       (2, 'Charlie Brown'),
       (3, 'Daffy Duck'),
       (4, 'Homer Simpson'),
       (5, 'Marge Simpson'),
       (6, 'Tweety');

 * sqlite://
Done.
6 rows affected.
Done.
6 rows affected.

[]

In [4]:
%%sql 
SELECT * FROM sqlite_master;

 * sqlite://
Done.

[('table', 'aTable', 'aTable', 2, 'CREATE TABLE aTable (\n    pkey     INTEGER PRIMARY KEY,\n    name     varchar(24)\n)'),
 ('table', 'bTable', 'bTable', 3, 'CREATE TABLE bTable\n(\n    pkey     INTEGER PRIMARY KEY,\n    fkey     int,\n    name     varchar(24)\n)')]

## JOINS

* https://www.w3schools.com/sql/sql_join.asp
* RIGHT and FULL OUTER JOINs are not currently supported in sqlite 3

In [5]:
%%sql
SELECT * FROM aTable JOIN bTable USING (pkey);

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 'Bugs Bunny'),
 (2, 'Popeye', 2, 'Charlie Brown'),
 (3, 'Daffy Duck', 3, 'Daffy Duck'),
 (4, 'Mickey Mouse', 4, 'Homer Simpson'),
 (5, 'Minnie Mouse', 5, 'Marge Simpson'),
 (6, 'Tweety', 6, 'Tweety')]

In [6]:
# save output from previous cell and create a dataframe
result = _
df = result.DataFrame()
df.columns = ['pkey', 'aTable', 'fkey', 'bTable']
df

   pkey        aTable  fkey         bTable
0     1    Bugs Bunny     1     Bugs Bunny
1     2        Popeye     2  Charlie Brown
2     3    Daffy Duck     3     Daffy Duck
3     4  Mickey Mouse     4  Homer Simpson
4     5  Minnie Mouse     5  Marge Simpson
5     6        Tweety     6         Tweety

## LEFT JOIN

Return all records from aTable and values that match from bTable. If no match, return null (None)

In [7]:
%%sql
SELECT * FROM aTable
LEFT JOIN bTable
ON aTable.name = bTable.name;

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 1, 'Bugs Bunny'),
 (2, 'Popeye', None, None, None),
 (3, 'Daffy Duck', 3, 3, 'Daffy Duck'),
 (4, 'Mickey Mouse', None, None, None),
 (5, 'Minnie Mouse', None, None, None),
 (6, 'Tweety', 6, 6, 'Tweety')]

## LEFT JOIN WHERE

Return records from aTable and bTable based on some where condition

In [8]:
%%sql
SELECT * FROM aTable
LEFT JOIN bTable
ON aTable.name = bTable.name
WHERE bTable.fkey IS not null;

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 1, 'Bugs Bunny'),
 (3, 'Daffy Duck', 3, 3, 'Daffy Duck'),
 (6, 'Tweety', 6, 6, 'Tweety')]

## INNER JOIN

Returns the set of records that match in both aTable and bTable

In [9]:
%%sql
SELECT * FROM aTable
INNER JOIN bTable
ON aTable.name = bTable.name;

 * sqlite://
Done.

[(1, 'Bugs Bunny', 1, 1, 'Bugs Bunny'),
 (3, 'Daffy Duck', 3, 3, 'Daffy Duck'),
 (6, 'Tweety', 6, 6, 'Tweety')]

## Using Aliases

In [10]:
%%sql
SELECT a.pkey, a.name FROM aTable a, btable b WHERE a.name = b.name;

 * sqlite://
Done.

[(1, 'Bugs Bunny'), (3, 'Daffy Duck'), (6, 'Tweety')]

In [11]:
%%sql
SELECT a.pkey, a.name FROM aTable a, btable b WHERE a.pkey = b.fkey and b.fkey = 1;

 * sqlite://
Done.

[(1, 'Bugs Bunny')]

In [12]:
import sqlite3

connection = sqlite3.connect('looneylms.db') # sqlite will create looneylms.db if it doesn't exist, 
                                             # a file now in the same folder as this file
cursor = connection.cursor()
print(connection.total_changes)

0

In [13]:
# multiline strings in Python can be sorrounded with ''' Multi line text '''
query = '''
CREATE TABLE IF NOT EXISTS people (
    id INTEGER PRIMARY KEY, 
    firstname TEXT, 
    lastname TEXT, 
    year INTEGER
)
'''
cursor.execute(query)

In [14]:
# populate people table
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Bugs', 'Bunny', 1)")
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Fifi', 'La Fume', 3)")
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Daffy', 'Duck', 2)")
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Foghorn', 'Leghorn', 1)")
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Tweety', 'Bird', 4)")
cursor.execute("INSERT INTO people(firstname, lastname, year) VALUES ('Porky', 'Pig', 4)")

In [15]:
rows = cursor.execute("SELECT * FROM people").fetchall()
print(rows)

[(1, 'Bugs', 'Bunny', 1), (2, 'Fifi', 'La Fume', 3), (3, 'Daffy', 'Duck', 2), (4, 'Foghorn', 'Leghorn', 1), (5, 'Tweety', 'Bird', 4), (6, 'Porky', 'Pig', 4)]

In [16]:
query = '''
CREATE TABLE IF NOT EXISTS quizzes (
    id INTEGER PRIMARY KEY, 
    quizname TEXT, 
    description TEXT
)
'''
cursor.execute(query)

In [17]:
cursor.execute("INSERT INTO quizzes(quizname, description) VALUES ('Looney', 'quiz about laughing')")
cursor.execute("INSERT INTO quizzes(quizname, description) VALUES ('Tune', 'quiz about tunes')")

In [18]:
rows = cursor.execute("SELECT * FROM quizzes").fetchall()
print(rows)

[(1, 'Looney', 'quiz about laughing'), (2, 'Tune', 'quiz about tunes')]

In [19]:
query = '''
CREATE TABLE IF NOT EXISTS quiz_details (
    id INTEGER PRIMARY KEY, 
    quizzes_id INTEGER, 
    items INTEGER,
    FOREIGN KEY (quizzes_id) 
      REFERENCES quizzes (id) 
         ON DELETE NO ACTION 
         ON UPDATE CASCADE
)
'''
cursor.execute(query)

In [20]:
cursor.execute("INSERT INTO quiz_details(quizzes_id, items) VALUES (1, 10)")
cursor.execute("INSERT INTO quiz_details(quizzes_id, items) VALUES (2, 10)")

In [21]:
rows = cursor.execute("SELECT * FROM quiz_details").fetchall()
print(rows)

[(1, 1, 10), (2, 2, 10)]

In [22]:
query = '''
CREATE TABLE IF NOT EXISTS quiz_results (
    id INTEGER PRIMARY KEY, 
    quizzes_id INTEGER, 
    people_id INTEGER,
    score INTEGER,
    FOREIGN KEY (people_id) 
      REFERENCES people (id) 
         ON DELETE NO ACTION 
         ON UPDATE CASCADE,
    FOREIGN KEY (quizzes_id) 
      REFERENCES quizzes (id) 
         ON DELETE NO ACTION 
         ON UPDATE CASCADE
)
'''
cursor.execute(query)

In [23]:
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (1, 3, 7)")
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (2, 5, 8)")
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (2, 1, 9)")
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (1, 4, 8)")
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (2, 3, 7)")
cursor.execute("INSERT INTO quiz_results(quizzes_id, people_id, score) VALUES (1, 2, 8)")

In [24]:
rows = cursor.execute("SELECT * FROM quiz_results").fetchall()
print(rows)

[(1, 1, 3, 7), (2, 2, 5, 8), (3, 2, 1, 9), (4, 1, 4, 8), (5, 2, 3, 7), (6, 1, 2, 8)]

In [25]:
query = '''
UPDATE people
SET id = 7
WHERE firstname = 'Daffy';
'''
cursor.execute(query)
rows = cursor.execute("SELECT * FROM people").fetchall()
print(rows)

[(1, 'Bugs', 'Bunny', 1), (2, 'Fifi', 'La Fume', 3), (4, 'Foghorn', 'Leghorn', 1), (5, 'Tweety', 'Bird', 4), (6, 'Porky', 'Pig', 4), (7, 'Daffy', 'Duck', 2)]

In [26]:
cursor.execute(query)
rows = cursor.execute("SELECT * FROM quiz_results").fetchall()
print(rows)

[(1, 1, 3, 7), (2, 2, 5, 8), (3, 2, 1, 9), (4, 1, 4, 8), (5, 2, 3, 7), (6, 1, 2, 8)]

## Views

In [27]:
query = '''
SELECT 
    quizzes.quizname as quiz, 
    people.firstname as firstname, 
    people.lastname as lastname, 
    quiz_results.score as score, 
    people.year as year
FROM 
    quiz_results
INNER JOIN people ON people.id = quiz_results.people_id
INNER JOIN quizzes ON quizzes.id = quiz_results.quizzes_id
ORDER BY quizzes.id;
'''
results = cursor.execute(query).fetchall()
for r in results:
    print(r)

('Looney', 'Foghorn', 'Leghorn', 8, 1)
('Looney', 'Fifi', 'La Fume', 8, 3)
('Tune', 'Tweety', 'Bird', 8, 4)
('Tune', 'Bugs', 'Bunny', 9, 1)

In [28]:
query = '''
CREATE VIEW quiz_takers
AS
SELECT 
    quizzes.quizname as quiz, 
    people.firstname as firstname, 
    people.lastname as lastname, 
    quiz_results.score as score, 
    people.year as year
FROM 
    quiz_results
INNER JOIN people ON people.id = quiz_results.people_id
INNER JOIN quizzes ON quizzes.id = quiz_results.quizzes_id
ORDER BY quizzes.id;
'''
cursor.execute(query)

In [29]:
rows = cursor.execute("SELECT * FROM quiz_takers").fetchall()
for r in rows:
    print(r)

('Looney', 'Foghorn', 'Leghorn', 8, 1)
('Looney', 'Fifi', 'La Fume', 8, 3)
('Tune', 'Tweety', 'Bird', 8, 4)
('Tune', 'Bugs', 'Bunny', 9, 1)

## Using Pandas

In [30]:
# https://datacarpentry.org/python-ecology-lesson/09-working-with-sql/index.html
import pandas as pd

df = pd.read_sql_query("SELECT * FROM quiz_takers", connection)
print(df.head())

     quiz firstname lastname  score  year
0  Looney   Foghorn  Leghorn      8     1
1  Looney      Fifi  La Fume      8     3
2    Tune    Tweety     Bird      8     4
3    Tune      Bugs    Bunny      9     1

In [31]:
from contextlib import closing

with closing(sqlite3.connect("looneylms.db")) as connection:
    with closing(connection.cursor()) as cursor:
        rows = cursor.execute("SELECT 1").fetchall()
        print(rows)

[(1,)]

Start completely over

* Kernel Restart and clear output
* Delete looneylms.db 
* Kernel Restart and run all

## SQLAlchemy

* SQLAlchemy provides a nice “Pythonic” way of interacting with databases. So rather than dealing with the differences between specific dialects of traditional SQL such as MySQL or PostgreSQL or Oracle, you can leverage the Pythonic framework of SQLAlchemy to streamline your workflow and more efficiently query your data.

https://towardsdatascience.com/sqlalchemy-python-tutorial-79a577141a91

## ORM

* ORM (Object Relational Mapping) is a programming technique for converting data between incompatible type systems in object-oriented programming languages. Usually, the type system used in an Object Oriented (OO) language like Python contains non-scalar types. These cannot be expressed as primitive types such as integers and strings. Hence, the OO programmer has to convert objects in scalar data to interact with backend database. However, data types in most of the database products such as Oracle, MySQL, etc., are primary. In an ORM system, each class maps to a table in the underlying database. Instead of writing tedious database interfacing code yourself, an ORM takes care of these issues for you while you can focus on programming the logics of the system.

https://www.tutorialspoint.com/sqlalchemy/sqlalchemy_introduction.htm

In [32]:
# pip install sqlalchemy

In [33]:
# how to connect to different databases https://www.tutorialspoint.com/sqlalchemy/sqlalchemy_core_connecting_to_database.htm
import pandas as pd
import sqlalchemy as db
from sqlalchemy.sql import select

print(db.__version__)

engine = db.create_engine('sqlite:///looneyalchemy.db') # creates a new database
connection = engine.connect()
metadata = db.MetaData()

# define people table
people = db.Table('people', metadata,
              db.Column('Id', db.Integer(), primary_key=True),
              db.Column('firstname', db.String(255)),
              db.Column('lastname', db.String(255)),
              db.Column('year', db.Integer())
              )

# create table
metadata.create_all(engine) 

# insert data
query = db.insert(people).values(Id=1, firstname='Bugs', lastname='Bunny', year=4).prefix_with("OR IGNORE") 
connection.execute(query)

query = db.insert(people).prefix_with("OR IGNORE")
values_list = [{'Id':'2', 'firstname': 'Tweety', 'lastname': 'Bird', 'year': 3},
               {'Id':'3', 'firstname': 'Daffy', 'lastname': 'Duck', 'year': 4}]
connection.execute(query, values_list)


metadata = db.MetaData()
people = db.Table('people', metadata, autoload=True, autoload_with=engine)

print('column keys:', people.columns.keys())
print()
print(repr(metadata.tables['people']))

# select * from people
query = db.select([people])
result = connection.execute(query)
rows = result.fetchall()
df = pd.DataFrame(rows)
df.columns = people.columns.keys()
print()
print(df.head())

1.4.22
column keys: ['Id', 'firstname', 'lastname', 'year']

Table('people', MetaData(), Column('Id', INTEGER(), table=<people>, primary_key=True, nullable=False), Column('firstname', VARCHAR(length=255), table=<people>), Column('lastname', VARCHAR(length=255), table=<people>), Column('year', INTEGER(), table=<people>), schema=None)

   Id firstname lastname  year
0   1      Bugs    Bunny     4
1   2    Tweety     Bird     3
2   3     Daffy     Duck     4